---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.GetCircuitNamingSchemeSettings(Autodesk.Revit.DB.Document)
source: html/fdb5ac56-200e-61aa-c2b9-4ffdd6ba9a12.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.GetCircuitNamingSchemeSettings Method

Gets the circuit naming scheme settings of the project.

## Syntax (C#)
```csharp
public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings(
	Document cda
)
```

## Parameters
- **cda** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The circuit naming scheme settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null